Revit 2018 API
OverrideGraphicSettings.SetProjectionFillPatternId Method
 Sets the projection surface fill pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2014
Syntax
C#
public OverrideGraphicSettings SetProjectionFillPatternId(
	ElementId fillPatternId
)
Visual Basic
Public Function SetProjectionFillPatternId ( _
	fillPatternId As ElementId _
) As OverrideGraphicSettings
Visual C++
public:
OverrideGraphicSettings^ SetProjectionFillPatternId(
	ElementId^ fillPatternId
)
Parameters
fillPatternId
Type: Autodesk.Revit.DB.ElementId
 ElementId of the projection surface fill pattern for the override. InvalidElementId means no override is set. The pattern must be a drafting pattern.
Return Value
 Reference to the changed object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace